CSI API ETABS v1
cPropMaterial.GetOConcrete_1 Method
 Retrieves the other material property data for concrete materials.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetOConcrete_1(
	string Name,
	ref double Fc,
	ref bool IsLightweight,
	ref double FcsFactor,
	ref int SSType,
	ref int SSHysType,
	ref double StrainAtFc,
	ref double StrainUltimate,
	ref double FinalSlope,
	ref double FrictionAngle,
	ref double DilatationalAngle,
	double Temp = 0
)
Function GetOConcrete_1 (
	Name As String,
	ByRef Fc As Double,
	ByRef IsLightweight As Boolean,
	ByRef FcsFactor As Double,
	ByRef SSType As Integer,
	ByRef SSHysType As Integer,
	ByRef StrainAtFc As Double,
	ByRef StrainUltimate As Double,
	ByRef FinalSlope As Double,
	ByRef FrictionAngle As Double,
	ByRef DilatationalAngle As Double,
	Optional Temp As Double = 0
) As Integer
Dim instance As cPropMaterial
Dim Name As String
Dim Fc As Double
Dim IsLightweight As Boolean
Dim FcsFactor As Double
Dim SSType As Integer
Dim SSHysType As Integer
Dim StrainAtFc As Double
Dim StrainUltimate As Double
Dim FinalSlope As Double
Dim FrictionAngle As Double
Dim DilatationalAngle As Double
Dim Temp As Double
Dim returnValue As Integer
returnValue = instance.GetOConcrete_1(Name,
	Fc, IsLightweight, FcsFactor, SSType,
	SSHysType, StrainAtFc, StrainUltimate,
	FinalSlope, FrictionAngle, DilatationalAngle,
	Temp)
int GetOConcrete_1(
	String^ Name,
	double% Fc,
	bool% IsLightweight,
	double% FcsFactor,
	int% SSType,
	int% SSHysType,
	double% StrainAtFc,
	double% StrainUltimate,
	double% FinalSlope,
	double% FrictionAngle,
	double% DilatationalAngle,
	double Temp = 0
)
abstract GetOConcrete_1 :
        Name : string *
        Fc : float byref *
        IsLightweight : bool byref *
        FcsFactor : float byref *
        SSType : int byref *
        SSHysType : int byref *
        StrainAtFc : float byref *
        StrainUltimate : float byref *
        FinalSlope : float byref *
        FrictionAngle : float byref *
        DilatationalAngle : float byref *
        ?Temp : float
(* Defaults:
        let _Temp = defaultArg Temp 0
*)
-> int
Parameters
Name
Type: System.String
The name of an existing concrete material property.
Fc
Type: System.Double
IsLightweight
Type: System.Boolean
If this item is True, the concrete is assumed to be lightweight concrete.
FcsFactor
Type: System.Double
SSType
Type: System.Int32
This is 0, 1 or 2, indicating the stress-strain curve type.
Value | SSType
0 | User defined
1 | Parametric - Simple
2 | Parametric - Mander
SSHysType
Type: System.Int32
This is 0 through 7, indicating the stress-strain curve type.
Value | SSHysType
0 | Elastic
1 | Kinematic
2 | Takeda
3 | Pivot
4 | Concrete
5 | BRB Hardening
6 | Degrading
7 | Isotropic
StrainAtFc
Type: System.Double
StrainUltimate
Type: System.Double
This item applies only to parametric stress-strain curves. It is the ultimate unconfined strain capacity. This item must be larger than the StrainAtfc item
FinalSlope
Type: System.Double
This item applies only to parametric stress-strain curves. It is a multiplier on the material modulus of elasticity, E. This value multiplied times E gives the final slope on the compression side of the curve.
FrictionAngle
Type: System.Double
The Drucker-Prager friction angle. This item must be smaller or equal to 0 and less than 90. [deg]
DilatationalAngle
Type: System.Double
The Drucker-Prager dilatational angle. This item must be smaller or equal to 0 and less than 90. [deg]
Temp (Optional)
Type: System.Double
The temperature at which the specified data is to be retrieved. The temperature must have been defined previously for the material.
This item applies only if the specified material has properties that are temperature dependent. That is, it applies only if properties are specified for the material at more than one temperature.
Return Value
Type: Int32
Returns zero if the data is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim fc As Double
       Dim IsLightweight As Boolean
       Dim fcsfactor As Double
       Dim SSType As Integer
       Dim SSHysType As Integer
       Dim StrainAtfc As Double
       Dim StrainUltimate As Double
       Dim FinalSlope As Double
       Dim FrictionAngle As Double
       Dim DilatationalAngle As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'initialize new material property
       ret = SapModel.PropMaterial.SetMaterial("Concrete", eMatType.Concrete)
   'assign other properties
       ret = SapModel.PropMaterial.SetOConcrete_1("Concrete", 5, False, 0, 1, 2, 0.0022, 0.0052, -0.1)
   'get other properties
       ret = SapModel.PropMaterial.GetOConcrete_1("Concrete", fc, IsLightweight, fcsfactor, SSType, SSHysType, StrainAtfc, StrainUltimate, FinalSlope, FrictionAngle, DilatationalAngle)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropMaterial Interface
ETABSv1 Namespace